# Brewfile
#
# Maintained by EngineerBetter

# Install and manage GUI macOS applications
tap 'homebrew/cask'
# Alternate versions of Casks
tap 'homebrew/cask-versions'
# Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'homebrew/services'
# Cloudfoundry binaries
tap 'cloudfoundry/tap'
# VMWare Tanzu binaries
tap 'vmware-tanzu/carvel'

### System {{{
  ## System Libraries
  # GNU Transport Layer Security (TLS) Library
  brew 'gnutls'
  # Library for command-line editing
  brew 'readline'
### }}}

### Web {{{
  # Container Runtime
  cask 'docker'

  # Internet file retriever
  brew 'wget'
### }}}

### Network {{{
  # Port scanning utility for large networks
  brew 'nmap'

  ## DNS
  # Command line DNS client https://dns.lookup.dog/
  brew 'dog'

  ## Utility
  # User interface to the TELNET protocol
  brew 'telnet'
### }}}

### Utility {{{
  # GNU File, Shell, and Text utilities
  brew 'coreutils'
  # Graph visualization software from AT&T and Bell Labs
  brew 'graphviz'

  ## Compress/Uncompress
  # 7-Zip (high compression file archiver) implementation
  brew 'p7zip'
  # Executes a program periodically, showing output fullscreen
  brew 'watch'
  # Simplified and community-driven man pages
  brew 'tldr'

  # GNU version of awk and sed
  brew 'gawk'
  brew 'gnu-sed'

  # JSON, YAML, XML transformation
  brew 'jq'
  brew 'yj'
  brew 'yq'
  brew 'xmlstarlet'
  brew 'ytt'

  # Tracks most-used directories to make cd smarter
  brew 'z'
### }}}

### Database {{{
  # Object-relational database system
  brew 'postgresql'
  # Command-line interface for SQLite
  brew 'sqlite'
  # MySQL Client
  brew 'mysql-client'
### }}}

### Programming Language {{{
  ## Node.js
  # Platform built on V8 to build network applications
  brew 'node@10'
  # Alternative JavaScript package manager by Facebook
  brew 'yarn'

  ## Python
  # Python3
  brew 'python'
  # Python version management
  brew 'pyenv'
  # Python dependency management tool
  brew 'pipenv'

  ## Shellscript
  # Static analysis and lint tool, for (ba)sh scripts
  brew 'shellcheck'

  ## Ruby
  # Powerful, clean, object-oriented scripting language
  brew 'ruby'
  brew 'rbenv'
  brew 'rbspy'
### }}}

### Secrets Management {{{
  # AWS Vault is a tool to securely store and access AWS credentials
  cask 'aws-vault'
  # Credhub command-line interface
  brew 'credhub-cli'
  # Secures, stores, and tightly controls access to secrets
  brew 'vault'
  # Offers more cli functionality than vault
  brew 'starkandwayne/cf/safe'
### }}}

### Git {{{
  ## Grom committing sensitive information to a git repo
  brew 'git-secrets'
  # Text interface for Git repositories
  brew 'tig'
  # GitHub CLI tool
  brew 'gh'
### }}}

### Code Editor & IDE {{{
  ## Editor: Vim
  # Vi 'workalike' with many additional features
  brew 'vim'
  # Fast, highly customisable system info script
  brew 'neofetch'
  # Ambitious Vim-fork focused on extensibility and agility
  brew 'neovim'
### }}}

### Terminal {{{
  ## Terminal Multiplexer
  # Terminal multiplexer with VT100/ANSI terminal emulation
  brew 'screen'
  # A terminal multiplexer, allowing to access multiple separate terminal sessions
  # brew 'tmux', args: ['with-utf8proc']
  brew 'tmux'
  # Reattach process (e.g., tmux) to background
  brew 'reattach-to-user-namespace'

  ## Utility
  # Search tool like grep, but optimized for programmers
  brew 'ack'
  # Search tool like grep and The Silver Searcher
  brew 'ripgrep'
  # Modern replacement for `ls`
  brew 'exa'
  # Display directories as trees (with optional color/HTML output)
  brew 'tree'
  # A simple, fast and user-friendly alternative to find
  brew 'fd'
  # Manage multiple runtime versions with a single CLI tool
  brew 'asdf'
  # Clone of cat with syntax highlighting and Git integration
  brew 'bat'

  ## Shell: Bash
  # Bourne-Again SHell, a UNIX command interpreter
  brew 'bash'
  # Programmable completion for Bash 4.1+
  brew 'bash-completion@2'

  ## Shell: Zsh
  # UNIX shell (command interpreter)
  # INFO: Need to add `/usr/local/bin/zsh` to `/etc/shells`
  brew 'zsh'
  # Tips, tricks, and examples for zsh
  brew 'zsh-lovers'
  # Fish shell like syntax highlighting for zsh
  brew 'zsh-syntax-highlighting'
#}}}

### Containers {{{
  # Tool for repeatable Kubernetes development
  brew 'skaffold'
### }}}

### Kubernetes {{{
  # Kubernetes command-line interface
  brew 'kubernetes-cli'
  # Customization of kubernetes YAML configurations
  brew 'kustomize'
  # Tool that can switch between kubectl contexts easily and create aliases
  brew 'kubectx'
  # Kubernetes CLI to manage cluters in style
  tap 'derailed/k9s'
  brew 'k9s'
  # Package manager for kubectl plugins
  brew 'krew'
  # ksd is a tool, whose aim is help you to visualize in text plain your kubernetes secrets
  brew 'mfuentesg/tap/ksd'
  # Tool that can switch between kubectl contexts
  brew 'kubectx'
  # Tail multiple Kubernetes pods & their containers
  brew 'stern'
  # Production Grade K8s Installation, Upgrades, and Management
  brew 'kops'
  # Kube in Docker
  brew 'kind'
### }}}

### BOSH/CF {{{
  # Cloudfoundry command-line interface
  brew 'cf-cli'
  # BOSH command-line interface
  brew 'bosh-cli'
  # CLI to configure and deploy tiles to Ops-Manager
  tap 'pivotal-cf/om', 'https://github.com/pivotal-cf/om'
  brew 'pivotal-cf/om/om'
### }}}

### Concourse {{{
  # Integration-tests Concourse tasks
  brew 'engineerbetter/tap/ironbird'
  # Managed concourse
  brew 'engineerbetter/tap/control-tower'
  # OPA cli
  brew 'opa'
### }}}

### Terraform {{{
  # Tool to generate documentation from Terraform modules
  brew 'terraform-docs'
  # Terraform linter for detecting errors that can not be detected by `terraform plan`
  tap 'wata727/tflint'
  brew 'tflint'
  # Terraform static analysis tool
  brew 'tfsec'
  # Terraform version manager
  brew 'tfenv'
### }}}

### Cloud CLI Binaries {{{
  brew 'awscli'
  brew 'awslogs'
  brew 'aws-iam-authenticator'
  # This tool will request and set temporary credentials in your shell environment variables for a given role.
  brew 'remind101/formulae/assume-role'
  # Azure Binaries
  brew 'azure-cli'
  # GCloud Libraries
  cask 'google-cloud-sdk'
### }}}

### Security {{{
  # SSL/TLS cryptography library
  brew 'openssl'
  ## PGP(Pretty Good Privacy)
  # GNU Pretty Good Privacy (PGP) package
  brew 'gnupg'
  # Pinentry for GPG on Mac
  brew 'pinentry-mac'
  # Tool for managing your YubiKey configuration
  brew 'ykman'
  # Library access to GnuPG
  brew 'gpgme'
  # A password manager
  brew 'lastpass-cli'
  # 1Password password manager
  cask '1password-cli'
### }}}

### Applications {{{
  # Web browser focusing on privacy
  cask 'brave-browser'
  # Open source code editor
  cask 'visual-studio-code'
  # Team communication and collaboration software
  cask 'slack'
  # Video communication and virtual meeting platform
  cask 'zoom'
  # Voice and text chat software
  cask 'discord'
### }}}
